SecondHandCoder/CherryLink/board/ch32f205_dap.h
#ifndef __CH32F205_DAP_H__
#define __CH32F205_DAP_H__

#include "ch32f20x.h"
#include "ch32f205_dap_config.h"

#ifdef __cplusplus
extern "C" {
#endif

// LED
#define PERIPHERAL_LED_CON_IDX                              GPIOA
#define PERIPHERAL_LED_CON_PIN                              GPIO_BSHR_BS8
#define PERIPHERAL_LED_CON_BIT                              (8)
#define PERIPHERAL_LED_CON_MASK                             GPIO_CFG_MASK_PIN_8
#define PERIPHERAL_LED_CON_OPP_CFG                          GPIO_CFG_OPP_PIN_8
#define PERIPHERAL_LED_CON_RCC_EN()                         (RCC->APB2PCENR |= RCC_IOPAEN)

#if (PERIPHERAL_LED_CON_BIT < 8)    
#define DAP_LED_CON_TO_OPP()                                (PERIPHERAL_LED_CON_IDX->CFGLR = ((PERIPHERAL_LED_CON_IDX->CFGLR & PERIPHERAL_LED_CON_MASK) | PERIPHERAL_LED_CON_OPP_CFG))
#else
#define DAP_LED_CON_TO_OPP()                                (PERIPHERAL_LED_CON_IDX->CFGHR = ((PERIPHERAL_LED_CON_IDX->CFGHR & PERIPHERAL_LED_CON_MASK) | PERIPHERAL_LED_CON_OPP_CFG))
#endif

#define DAP_LED_CON_SET_ON()                                (PERIPHERAL_LED_CON_IDX->BCR = PERIPHERAL_LED_CON_PIN)  
#define DAP_LED_CON_SET_OFF()                               (PERIPHERAL_LED_CON_IDX->BSHR = PERIPHERAL_LED_CON_PIN)


#define PERIPHERAL_LED_STA_IDX                              GPIOA
#define PERIPHERAL_LED_STA_PIN                              GPIO_BSHR_BS10
#define PERIPHERAL_LED_STA_BIT                              (10)
#define PERIPHERAL_LED_STA_MASK                             GPIO_CFG_MASK_PIN_10
#define PERIPHERAL_LED_STA_OPP_CFG                          GPIO_CFG_OPP_PIN_10
#define PERIPHERAL_LED_STA_RCC_EN()                         (RCC->APB2PCENR |= RCC_IOPAEN)

#if (PERIPHERAL_LED_STA_BIT < 8)    
#define DAP_LED_STA_TO_OPP()                                (PERIPHERAL_LED_STA_IDX->CFGLR = ((PERIPHERAL_LED_STA_IDX->CFGLR & PERIPHERAL_LED_STA_MASK) | PERIPHERAL_LED_STA_OPP_CFG))
#else
#define DAP_LED_STA_TO_OPP()                                (PERIPHERAL_LED_STA_IDX->CFGHR = ((PERIPHERAL_LED_STA_IDX->CFGHR & PERIPHERAL_LED_STA_MASK) | PERIPHERAL_LED_STA_OPP_CFG))
#endif

#define DAP_LED_STA_SET_ON()                                (PERIPHERAL_LED_STA_IDX->BCR = PERIPHERAL_LED_STA_PIN)
#define DAP_LED_STA_SET_OFF()                               (PERIPHERAL_LED_STA_IDX->BSHR = PERIPHERAL_LED_STA_PIN)


// CTRL
// CTRL0 - TCK
#define PERIPHERAL_CTRL0_IDX                                GPIOB
#define PERIPHERAL_CTRL0_PIN                                GPIO_BSHR_BS10
#define PERIPHERAL_CTRL0_BIT                                (10)
#define PERIPHERAL_CTRL0_MASK                               GPIO_CFG_MASK_PIN_10
#define PERIPHERAL_CTRL0_OPP_CFG                            GPIO_CFG_OPP_PIN_10
#define PERIPHERAL_CTRL0_RCC_EN()                           (RCC->APB2PCENR |= RCC_IOPBEN)

#if (PERIPHERAL_CTRL0_BIT < 8)    
#define CTRL0_TO_OPP()                                      (PERIPHERAL_CTRL0_IDX->CFGLR = ((PERIPHERAL_CTRL0_IDX->CFGLR & PERIPHERAL_CTRL0_MASK) | PERIPHERAL_CTRL0_OPP_CFG))
#else
#define CTRL0_TO_OPP()                                      (PERIPHERAL_CTRL0_IDX->CFGHR = ((PERIPHERAL_CTRL0_IDX->CFGHR & PERIPHERAL_CTRL0_MASK) | PERIPHERAL_CTRL0_OPP_CFG))
#endif

#define DAP_TCK_TO_OUT()                                    (PERIPHERAL_CTRL0_IDX->BSHR = PERIPHERAL_CTRL0_PIN)
#define DAP_TCK_TO_IN()                                     (PERIPHERAL_CTRL0_IDX->BCR = PERIPHERAL_CTRL0_PIN)     

// CTRL1 - TMS-MO
#define PERIPHERAL_CTRL1_IDX                                GPIOC
#define PERIPHERAL_CTRL1_PIN                                GPIO_BSHR_BS7
#define PERIPHERAL_CTRL1_BIT                                (7)
#define PERIPHERAL_CTRL1_MASK                               GPIO_CFG_MASK_PIN_7
#define PERIPHERAL_CTRL1_OPP_CFG                            GPIO_CFG_OPP_PIN_7
#define PERIPHERAL_CTRL1_RCC_EN()                           (RCC->APB2PCENR |= RCC_IOPCEN)

#if (PERIPHERAL_CTRL1_BIT < 8)    
#define CTRL1_TO_OPP()                                      (PERIPHERAL_CTRL1_IDX->CFGLR = ((PERIPHERAL_CTRL1_IDX->CFGLR & PERIPHERAL_CTRL1_MASK) | PERIPHERAL_CTRL1_OPP_CFG))
#else
#define CTRL1_TO_OPP()                                      (PERIPHERAL_CTRL1_IDX->CFGHR = ((PERIPHERAL_CTRL1_IDX->CFGHR & PERIPHERAL_CTRL1_MASK) | PERIPHERAL_CTRL1_OPP_CFG))
#endif

#define DAP_SWD_TMS_TO_OUT()                                (PERIPHERAL_CTRL1_IDX->BSHR = PERIPHERAL_CTRL1_PIN)
#define DAP_SWD_TMS_TO_IN()                                 (PERIPHERAL_CTRL1_IDX->BCR = PERIPHERAL_CTRL1_PIN)
#define DAP_JTAG_TMS_TO_OUT()                               DAP_SWD_TMS_TO_OUT()          
#define DAP_JTAG_TMS_TO_IN()                                DAP_SWD_TMS_TO_IN()

// CTRL2 - TDI
#define PERIPHERAL_CTRL2_IDX                                GPIOC
#define PERIPHERAL_CTRL2_PIN                                GPIO_BSHR_BS6
#define PERIPHERAL_CTRL2_BIT                                (6)
#define PERIPHERAL_CTRL2_MASK                               GPIO_CFG_MASK_PIN_6
#define PERIPHERAL_CTRL2_OPP_CFG                            GPIO_CFG_OPP_PIN_6
#define PERIPHERAL_CTRL2_RCC_EN()                           (RCC->APB2PCENR |= RCC_IOPCEN)

#if (PERIPHERAL_CTRL2_BIT < 8)    
#define CTRL2_TO_OPP()                                      (PERIPHERAL_CTRL2_IDX->CFGLR = ((PERIPHERAL_CTRL2_IDX->CFGLR & PERIPHERAL_CTRL2_MASK) | PERIPHERAL_CTRL2_OPP_CFG))
#else
#define CTRL2_TO_OPP()                                      (PERIPHERAL_CTRL2_IDX->CFGHR = ((PERIPHERAL_CTRL2_IDX->CFGHR & PERIPHERAL_CTRL2_MASK) | PERIPHERAL_CTRL2_OPP_CFG))
#endif

#define DAP_JTAG_TDI_TO_OUT()                               (PERIPHERAL_CTRL2_IDX->BSHR = PERIPHERAL_CTRL2_PIN)          
#define DAP_JTAG_TDI_TO_IN()                                (PERIPHERAL_CTRL2_IDX->BCR = PERIPHERAL_CTRL2_PIN)

// CTRL3 - TX
#define PERIPHERAL_CTRL3_IDX                                GPIOB
#define PERIPHERAL_CTRL3_PIN                                GPIO_BSHR_BS0
#define PERIPHERAL_CTRL3_BIT                                (0)
#define PERIPHERAL_CTRL3_MASK                               GPIO_CFG_MASK_PIN_0
#define PERIPHERAL_CTRL3_OPP_CFG                            GPIO_CFG_OPP_PIN_0
#define PERIPHERAL_CTRL3_RCC_EN()                           (RCC->APB2PCENR |= RCC_IOPBEN)
 
#if (PERIPHERAL_CTRL3_BIT < 8)    
#define CTRL3_TO_OPP()                                      (PERIPHERAL_CTRL3_IDX->CFGLR = ((PERIPHERAL_CTRL3_IDX->CFGLR & PERIPHERAL_CTRL3_MASK) | PERIPHERAL_CTRL3_OPP_CFG))
#else
#define CTRL3_TO_OPP()                                      (PERIPHERAL_CTRL3_IDX->CFGHR = ((PERIPHERAL_CTRL3_IDX->CFGHR & PERIPHERAL_CTRL3_MASK) | PERIPHERAL_CTRL3_OPP_CFG))
#endif

#define DAP_USB_CDC_TO_OUT()                                (PERIPHERAL_CTRL3_IDX->BSHR = PERIPHERAL_CTRL3_PIN)
#define DAP_USB_CDC_TO_IN()                                 (PERIPHERAL_CTRL3_IDX->BCR = PERIPHERAL_CTRL3_PIN)


