SecondHandCoder/CherryLink/board/ch32f205_dap.h
// SWD
#define PERIPHERAL_GPIO_TCK_SWD_IDX                         GPIOA
#define PERIPHERAL_GPIO_TCK_SWD_PIN                         GPIO_BSHR_BS5
#define PERIPHERAL_GPIO_TCK_SWD_BIT                         (5)
#define PERIPHERAL_GPIO_TCK_SWD_MASK                        GPIO_CFG_MASK_PIN_5
#define PERIPHERAL_GPIO_TCK_SWD_OPP_CFG                     GPIO_CFG_OPP_PIN_5
#define PERIPHERAL_GPIO_TCK_SWD_APP_CFG                     GPIO_CFG_APP_PIN_5
#define PERIPHERAL_GPIO_TCK_SWD_AIN_CFG                     GPIO_CFG_AIN_PIN_5
#define PERIPHERAL_GPIO_TCK_SWD_RCC_EN()                    (RCC->APB2PCENR |= RCC_IOPAEN)

#define PERIPHERAL_GPIO_TMS_MO_IDX                          GPIOA
#define PERIPHERAL_GPIO_TMS_MO_PIN                          GPIO_BSHR_BS7
#define PERIPHERAL_GPIO_TMS_MO_BIT                          (7)
#define PERIPHERAL_GPIO_TMS_MO_MASK                         GPIO_CFG_MASK_PIN_7
#define PERIPHERAL_GPIO_TMS_MO_OPP_CFG                      GPIO_CFG_OPP_PIN_7
#define PERIPHERAL_GPIO_TMS_MO_APP_CFG                      GPIO_CFG_APP_PIN_7
#define PERIPHERAL_GPIO_TMS_MO_AIN_CFG                      GPIO_CFG_AIN_PIN_7
#define PERIPHERAL_GPIO_TMS_MO_RCC_EN()                     (RCC->APB2PCENR |= RCC_IOPAEN)

#define PERIPHERAL_GPIO_TMS_MI_IDX                          GPIOA
#define PERIPHERAL_GPIO_TMS_MI_PIN                          GPIO_BSHR_BS6
#define PERIPHERAL_GPIO_TMS_MI_BIT                          (6)
#define PERIPHERAL_GPIO_TMS_MI_MASK                         GPIO_CFG_MASK_PIN_6
#define PERIPHERAL_GPIO_TMS_MI_FIN_CFG                      GPIO_CFG_FIN_PIN_6
#define PERIPHERAL_GPIO_TMS_MI_AIN_CFG                      GPIO_CFG_AIN_PIN_6
#define PERIPHERAL_GPIO_TMS_MI_RCC_EN()                     (RCC->APB2PCENR |= RCC_IOPAEN)

#if (PERIPHERAL_GPIO_TCK_SWD_BIT < 8)
#define DAP_SWD_TCK_TO_OPP()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_OPP_CFG))
#define DAP_SWD_TCK_TO_APP()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_APP_CFG))
#define DAP_SWD_TCK_TO_AIN()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGLR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_AIN_CFG))
#else
#define DAP_SWD_TCK_TO_OPP()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_OPP_CFG))
#define DAP_SWD_TCK_TO_APP()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_APP_CFG))
#define DAP_SWD_TCK_TO_AIN()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR = ((PERIPHERAL_GPIO_TCK_SWD_IDX->CFGHR & PERIPHERAL_GPIO_TCK_SWD_MASK) | PERIPHERAL_GPIO_TCK_SWD_AIN_CFG))
#endif
#define DAP_SWD_TCK_TO_HIGH()                               (PERIPHERAL_GPIO_TCK_SWD_IDX->BSHR = PERIPHERAL_GPIO_TCK_SWD_PIN)
#define DAP_SWD_TCK_TO_LOW()                                (PERIPHERAL_GPIO_TCK_SWD_IDX->BCR = PERIPHERAL_GPIO_TCK_SWD_PIN)
#define DAP_SWD_TCK_GET()                                   ((PERIPHERAL_GPIO_TCK_SWD_IDX->OUTDR & PERIPHERAL_GPIO_TCK_SWD_PIN) >> PERIPHERAL_GPIO_TCK_SWD_BIT)

#if (PERIPHERAL_GPIO_TMS_MO_BIT < 8)
#define DAP_SWD_TMS_MO_TO_OPP()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_OPP_CFG))
#define DAP_SWD_TMS_MO_TO_APP()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_APP_CFG))
#define DAP_SWD_TMS_MO_TO_AIN()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGLR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_AIN_CFG))
#define DAP_SWD_TMS_MI_TO_FIN()                             (PERIPHERAL_GPIO_TMS_MI_IDX->CFGLR = ((PERIPHERAL_GPIO_TMS_MI_IDX->CFGLR & PERIPHERAL_GPIO_TMS_MI_MASK) | PERIPHERAL_GPIO_TMS_MI_FIN_CFG))
#define DAP_SWD_TMS_MI_TO_AIN()                             (PERIPHERAL_GPIO_TMS_MI_IDX->CFGLR = ((PERIPHERAL_GPIO_TMS_MI_IDX->CFGLR & PERIPHERAL_GPIO_TMS_MI_MASK) | PERIPHERAL_GPIO_TMS_MI_AIN_CFG))
#else
#define DAP_SWD_TMS_MO_TO_OPP()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_OPP_CFG))
#define DAP_SWD_TMS_MO_TO_APP()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_APP_CFG))
#define DAP_SWD_TMS_MO_TO_AIN()                             (PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR = ((PERIPHERAL_GPIO_TMS_MO_IDX->CFGHR & PERIPHERAL_GPIO_TMS_MO_MASK) | PERIPHERAL_GPIO_TMS_MO_AIN_CFG))
#define DAP_SWD_TMS_MI_TO_FIN()                             (PERIPHERAL_GPIO_TMS_MI_IDX->CFGHR = ((PERIPHERAL_GPIO_TMS_MI_IDX->CFGHR & PERIPHERAL_GPIO_TMS_MI_MASK) | PERIPHERAL_GPIO_TMS_MI_FIN_CFG))
#define DAP_SWD_TMS_MI_TO_AIN()                             (PERIPHERAL_GPIO_TMS_MI_IDX->CFGHR = ((PERIPHERAL_GPIO_TMS_MI_IDX->CFGHR & PERIPHERAL_GPIO_TMS_MI_MASK) | PERIPHERAL_GPIO_TMS_MI_AIN_CFG))

#endif
#define DAP_SWD_TMS_TO_HIGH()                               (PERIPHERAL_GPIO_TMS_MO_IDX->BSHR = PERIPHERAL_GPIO_TMS_MO_PIN)
#define DAP_SWD_TMS_TO_LOW()                                (PERIPHERAL_GPIO_TMS_MO_IDX->BCR = PERIPHERAL_GPIO_TMS_MO_PIN)
#define DAP_SWD_TMS_GET()                                   ((PERIPHERAL_GPIO_TMS_MO_IDX->OUTDR & PERIPHERAL_GPIO_TMS_MO_PIN) >> PERIPHERAL_GPIO_TMS_MO_BIT)
#define DAP_SWD_TMS_READ()                                  ((PERIPHERAL_GPIO_TMS_MI_IDX->INDR & PERIPHERAL_GPIO_TMS_MI_PIN) >> PERIPHERAL_GPIO_TMS_MI_BIT)
#if (PERIPHERAL_GPIO_TMS_MI_BIT < 8)
#define DAP_SWD_TMS_READ_0x80()                             ((PERIPHERAL_GPIO_TMS_MI_IDX->INDR & PERIPHERAL_GPIO_TMS_MI_PIN) << (7 - PERIPHERAL_GPIO_TMS_MI_BIT))
#else
#define DAP_SWD_TMS_READ_0x80()                             ((PERIPHERAL_GPIO_TMS_MI_IDX->INDR & PERIPHERAL_GPIO_TMS_MI_PIN) >> (PERIPHERAL_GPIO_TMS_MI_BIT - 7))
#endif

